Revit 2016 API
BuiltInFailures.StructuralLoadFailures Members
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures.StructuralLoadFailures type exposes the following members.
Properties
Name | Description
CannotMirrorBoundaryCondition
 Can't mirror Boundary Conditions
CannotPlaceBoundaryConditions
 Can't find a host for Boundary Conditions
CannotPlaceBoundaryConditionsWarn
 Can't find a host for Boundary Conditions
HostChangeDisallowsLoadOrBoundaryConditions
 Some Hosted Loads or BoundaryConditions lost their References. They will be deleted.
See Also
BuiltInFailures.StructuralLoadFailures Class
Autodesk.Revit.DB Namespace